#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПриОбработкеПередИзменением
Процедура ПриОбработкеПравилаРегистрацииПередИзменениемОбъекта(Объект, Отказ, Параметры) Экспорт
	Отказ = Истина;
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПриОбработкеПослеИзменения
Процедура ПриОбработкеПравилаРегистрацииПослеИзмененияОбъекта(Объект, Отказ, Параметры) Экспорт
	Отказ = Истина;
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПослеОбработки
Процедура ПослеОбработкиПравилаРегистрации(Объект, Отказ, Параметры) Экспорт
	
	ИмяПроцедуры = "СинхронизацияДанныхБЗКОбработчикиНезависимыеРегистры.ПослеОбработкиПравилаРегистрации";
	
	ТекстОшибки = НСтр("ru = 'В параметре Параметры.ДополнительныеПараметры отсутствует свойство ""Измерение""'");
	ОбщегоНазначенияКлиентСервер.Проверить(Параметры.ДополнительныеПараметры.Свойство("Измерение"), ТекстОшибки,
		СтрШаблон(НСтр("ru = '%1'"), ИмяПроцедуры));
	
	Измерение = Параметры.ДополнительныеПараметры.Измерение;
	
	ОжидаемыеТипы = ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(Тип("Строка"), Тип("ОбъектМетаданных"));	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяПроцедуры, "Измерение", Измерение, ОжидаемыеТипы);
		
	Если ТипЗнч(Измерение) = Тип("Строка") Тогда
		ИмяИзмерения = Измерение;
	ИначеЕсли ТипЗнч(Измерение) = Тип("ОбъектМетаданных") Тогда
		ИмяИзмерения = Измерение.Имя;
	КонецЕсли;
	
	СинхронизацияДанныхЗарплатаКадрыСервер.ОпределитьМассивыУзловДляНабораЗаписейПоРегистрацииОбъектаВладельца(
		Объект, Отказ, ИмяИзмерения, Параметры);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
