//-- ExternalComponent.bsl
Процедура ПодключитьВнешнююКомпонентуПоProgID() Экспорт
    ProgID = "AddIn.ATOL_KKM_1С";

    // Использование внешних компонент
    Если НЕ ПодключитьВнешнююКомпоненту(ProgID, "Компонента", ТипВнешнейКомпоненты.Native) Тогда
        // Использование внешних компонент
        ЗагрузитьВнешнююКомпоненту(ProgID);
        // Использование внешних компонент
        УстановитьВнешнююКомпоненту(ProgID);
        // Использование внешних компонент
        НачатьПодключениеВнешнейКомпоненты(ProgID, "MB", ТипВнешнейКомпоненты.Native);
    КонецЕсли;
 
    Попытка
        MediaBuild = Новый("AddIn.MB.MediaExtention");
        // Использование внешних компонент
        НачатьУстановкуВнешнейКомпоненты(ProgID)
    Исключение
        Сообщить("Не могу создать объект из компоненты");
        Сообщить(ОписаниеОшибки());
        Возврат;
    КонецПопытки;

КонецПроцедуры
//==  ExternalComponent.bsl
