//-- EmptyBlocks.bsl
Процедура МояПроцедура(Пар1, Пар2, Пар3) Экспорт
    // Пустой блок
КонецПроцедуры

Функция МояФункция(Пар1, Пар2, Пар3) Экспорт
    // Пустой блок
КонецФункции

Процедура МояПроцедура(Пар1, Пар2, Пар3) Экспорт
    Если ДеньНедели(ТекущаяДата()) = 6 Тогда
        // Пустой блок
    ИначеЕсли ДеньНедели(ТекущаяДата()) = 7 Тогда
        // Пустой блок
    Иначе
        // Пустой блок
    КонецЕсли;

    Для ТекДень = 1 по ПоследнийДеньМесяца Цикл
        Состояние("Обрабатывается день: "+ ТекДень);
    КонецЦикла;

    Если Не Документ.Пустая() Тогда
        Для каждого СтрокаСостава из Документ.Состав Цикл
            // Пустой блок
        КонецЦикла;
    КонецЕсли;

    Пока ВыборкаДок.Следующий() Цикл
        Состояние("Обрабатывается документ №" + ВыборкаДок.Номер);
    КонецЦикла;

    Попытка
        // Пустой блок
    Исключение
        // Пустой блок
        // Пустой блок «Исключение»
    КонецПопытки;
КонецПроцедуры

Функция МояФункция1(Пар1, Пар2, Пар3) Экспорт
    Если ДеньНедели(ТекущаяДата()) = 6 Тогда
        Сообщить("Сегодня суббота.");
    ИначеЕсли ДеньНедели(ТекущаяДата()) = 7 Тогда
        Сообщить("Сегодня воскресенье.");
    Иначе
        Сообщить("Сегодня рабочий день.");
    КонецЕсли;

    Для ТекДень = 1 по ПоследнийДеньМесяца Цикл
        // Пустой блок
    КонецЦикла;

    Если Не Документ.Пустая() Тогда
        Для каждого СтрокаСостава из Документ.Состав Цикл
            Состояние("Строка: " + Документ.Состав.Индекс(СтрокаСостава)+1);
        КонецЦикла;
    КонецЕсли;

    Пока ВыборкаДок.Следующий() Цикл
        // Пустой блок
    КонецЦикла;

    Попытка
        Табл = Новый ComObject("Excel.Application");
    Исключение
        Предупреждение(ОписаниеОшибки());
        Возврат;
    КонецПопытки;

    Если УсловиеВыполнено(Отказ) Тогда
        // Пустой блок
    КонецЕсли;
КонецФункции
//== EmptyBlocks.bsl
