//-- AccessRightsChecking.bsl
Функция СортироватьМассивПользователейИБПередВыгрузкой(Знач ИсходныйМассив)
    ТЗ=Новый ТаблицаЗначений();
    ТЗ.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("Строка"));
    ТЗ.Колонки.Добавить("Администратор", Новый ОписаниеТипов("Строка"));

	Для Каждого ПользовательИБ Из ИсходныйМассив Цикл 
		СтрокаТЗ = ТЗ.Добавить();
        СтрокаТЗ.Пользователь = ПользовательИБ;
        // Права доступа для определенной роли/учетной записи
        СтрокаТЗ.Администратор = ПравоДоступа("АдминистрированиеДанных", Метаданные, СтрокаТЗ.Пользователь);
    КонецЦикла;

    ТЗ.Сортировать("Администратор Убыв");
    Возврат ТЗ.ВыгрузитьКолонку("Пользователь");
КонецФункции
//1== AccessRightsChecking.bsl
