//-- UnsafeMode.bsl
&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьСпособДоставки(Рассылка, Знач ПараметрыДоставки) Экспорт
    // Небезопасный режим
    УстановитьБезопасныйРежим(Ложь);
        Попытка
            ShellApplication.SetTime();
        Исключение
            ПараметрыЖурнала.Вставить("Данные",  Рассылка);
        КонецПопытки;
        возврат ПараметрыЖурнала;
    УстановитьБезопасныйРежим(Истина);


    Для НазваниеПерем = СчетчНачало по СчетчКонец Цикл
        Если 1 < 0 Тогда
            // Небезопасный режим
            УстановитьОтключениеБезопасногоРежима(Истина);
            УстановитьОтключениеБезопасногоРежима(ложь);
        Иначе
            Для н = 1 по 100 Цикл
                // Небезопасный режим
                SetDisableSafeMode(True);
                Сообщить("Команда выполняется в небезопасном режиме !");
                SetDisableSafeMode(False);
            КонецЦикла;
                // Небезопасный режим
                // Некорректная деактивация
                SetSafeMode(Ложь);
                Сообщить("Команда выполняется в небезопасном режиме !");
        КонецЕсли;

        // Небезопасный режим
        // Некорректная деактивация
        УстановитьОтключениеБезопасногоРежима(Истина);
        Сообщить("Команда выполняется в небезопасном режиме !");
    КонецЦикла;
КонецФункции
//== UnsafeMode.bsl
