Функция НайтиПоКонстанте()
    // Поиск элемента по константе
    Должность = Справочники.Должности.НайтиПоНаименованию("Ведущий бухгалтер");
    // Поиск элемента по константе
    Должность = Справочники.Должности.НайтиПоКоду("00-0000001");
    // Поиск элемента по константе
    ОбъектНазначения = Документы.ПередачаТоваровМеждуОрганизациями.НайтиПоНомеру("0000-000001", ТекущаяДата());
    // Поиск элемента по константе
    РезультатПоискаПоРеквизиту = Справочники.Преподаватели.НайтиПоРеквизиту("Стаж",РеквизитСтаж); // нет в BSL
КонецФункции

Функция НайтиПоКонстанте_ОтслеживатьТипВызывающегоОбъекта()
    ТекСправочник = Справочники.Преподаватели;

    // Поиск элемента по константе
    Должность = ТекСправочник.НайтиПоНаименованию("Ведущий бухгалтер");
    // Поиск элемента по константе
    Должность = ТекСправочник.НайтиПоКоду("00-0000001");
    // Поиск элемента по константе
    ОбъектНазначения = ТекСправочник.НайтиПоНомеру("0000-000001", ТекущаяДата());
    // Поиск элемента по константе
    РезультатПоискаПоРеквизиту = ТекСправочник.НайтиПоРеквизиту("Стаж",РеквизитСтаж); // нет в BSL
КонецФункции

Функция НайтиПоКонстанте_ОтслеживатьСостояниеПеременной()
    ЗахардкоженоеЗначение = "Константа";

    // TODO: Поиск элемента по константе
    Должность = Справочники.Должности.НайтиПоНаименованию(ЗахардкоженоеЗначение);
    // TODO: Поиск элемента по константе
    Должность = Справочники.Должности.НайтиПоКоду(ЗахардкоженоеЗначение);
    // TODO: Поиск элемента по константе
    ОбъектНазначения = Документы.ПередачаТоваровМеждуОрганизациями.НайтиПоНомеру(ЗахардкоженоеЗначение, ТекущаяДата());
    // TODO: Поиск элемента по константе
    РезультатПоискаПоРеквизиту = Справочники.Преподаватели.НайтиПоРеквизиту(ЗахардкоженоеЗначение, РеквизитСтаж); // нет в BSL
КонецФункции


Функция НайтиПоКонстанте_МеждуПроцедурныйАнализ()
    // TODO: Поиск элемента по константе
    Возврат НельзяПередаватьКонстанту_НайтиПоНаименованию("Ведущий бухгалтер");
КонецФункции
Функция НельзяПередаватьКонстанту_НайтиПоНаименованию(НаименованиеЭлемента)
    Возврат Справочники.Преподаватели.НайтиПоНаименованию(НаименованиеЭлемента);
КонецФункции

Функция НайтиПоКонстанте_МеждуПроцедурныйАнализ()
    // TODO: Поиск элемента по константе
    Возврат НельзяПередаватьКонстанту_НайтиПоКоду("00-0000001");
КонецФункции
Функция НельзяПередаватьКонстанту_НайтиПоКоду(НаименованиеЭлемента)
    Возврат Справочники.Преподаватели.НайтиПоКоду(НаименованиеЭлемента);
КонецФункции

Функция НайтиПоКонстанте_МеждуПроцедурныйАнализ()
    // TODO: Поиск элемента по константе
    Возврат НельзяПередаватьКонстанту_НайтиПоНомеру("00-0000001");
КонецФункции
Функция НельзяПередаватьКонстанту_НайтиПоНомеру(НаименованиеЭлемента)
    Возврат Справочники.Преподаватели.НайтиПоНомеру(НаименованиеЭлемента);
КонецФункции

Функция НайтиПоКонстанте_МеждуПроцедурныйАнализ()
    // TODO: Поиск элемента по константе
    Возврат НельзяПередаватьКонстанту_НайтиПоРеквизиту("Стаж");
КонецФункции
Функция НельзяПередаватьКонстанту_НайтиПоРеквизиту(НаименованиеЭлемента)
    Возврат Справочники.Преподаватели.НайтиПоРеквизиту(НаименованиеЭлемента); // нет в BSL
КонецФункции
