//-- GotoStatement.bsl
Процедура GotoStatement(ТаблицаЗначенийПроценты)
    Если ТаблицаЗначенийПроценты = Неопределено Тогда
        // Оператор «Перейти»
        Перейти ~УпрощенныйРасчет;
    КонецЕсли;

    // Оператор «Перейти»
    Перейти ~ИдентификаторМетки;
    Сообщить("Неисполняемый фрагмент кода");
    ~ИдентификаторМетки:

    // Оператор «Перейти»
    Goto ~Label;
    Сообщить("Неисполняемый фрагмент кода");
    ~Label:

    Пока Истина Цикл
        // Оператор «Перейти»
        Перейти ~КонецЦикла;
        Сообщить("Неисполняемый фрагмент кода");
    КонецЦикла;
    ~КонецЦикла:
    ~УпрощенныйРасчет:
КонецПроцедуры

//== GotoStatement.bsl
