Текст = Новый ЧтениеТекста(ПутьФайла, КодировкаТекста.ANSI); // есть замечание
Текст = Новый ЗаписьТекста(ПутьФайла, КодировкаТекста.ANSI); // есть замечание

ЗначениеВФайл(ПутьФайла, ЛичныеДанные); // есть замечание
КопироватьФайл(ПутьФайла, ДругойПутьФайла); // есть замечание

МассивИмен = Новый Массив();
МассивИмен.Добавить(ПутьФайла);
ОбъединитьФайлы(МассивИмен, ДругойПутьФайла); // есть замечание

ПереместитьФайл(ПутьФайла, ДругойПутьФайла); // есть замечание
РазделитьФайл(ПутьФайла, 1024 * 1024 ); // есть замечание
СоздатьКаталог(ИмяКаталога); // есть замечание
УдалитьФайлы(ПутьФайла); // есть замечание