Функция ПримерФункции(Коллекция)
    СписокСтудентов = ПолучитьСписокСтудентов();

    Для Каждого Студент Из СписокСтудентов Цикл
        СуммаБаллов = 0;
        Баллы = Студент.ПолучитьБаллы();

        Для Каждого Оценка Из Баллы Цикл
            СуммаБаллов = СуммаБаллов + Оценка;

            Если СуммаБаллов > 100 Тогда
                Сообщить("Слишком много баллов");
                // ! Удалить из вложенного цикла во время итерирования
                СписокСтудентов.Удалить(Студент);
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;

КонецФункции
