Функция ПримерФункции(Коллекция)

    Для Каждого Студент Из ПолучитьСписокСтудентов() Цикл
        СуммаБаллов = 0;

        Для Каждого Оценка Из Студент.ПолучитьБаллы() Цикл
            СуммаБаллов = СуммаБаллов + Оценка;

            Если СуммаБаллов > 100 Тогда
                Сообщить("Слишком много баллов");
                // ! Удалить из вложенного цикла во время итерирования
                // Только если метод возвращает один и тот же объект, а не копию
                ПолучитьСписокСтудентов().Удалить(Студент);
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;

КонецФункции
