//-- Find.bsl\

Функция СотрудникПоФамилии()
    ИскомаяФамилия = "Петров";
    СписокСотрудников = Справочники.Сотрудники;

    Для Каждого Сотрудник из СписокСотрудников цикл
        // Функция Найти
        Если Найти(Сотрудник.Имя,ИскомаяФамилия) > 0 Тогда
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;

    Возврат Ложь;
КонецФункции


Функция СотрудникПоФамилии()
    ИскомаяФамилия = "Петров";
    СписокСотрудников = Справочники.Сотрудники;

    Для Каждого Сотрудник из СписокСотрудников цикл
        Если СтрНайти(Сотрудник.Имя,ИскомаяФамилия) > 0 Тогда
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;

    Возврат Ложь;
КонецФункции


Процедура НайтиВалютуПоКоду()
    СтрокаКода = "840";
    Валюты = Справочники.Валюты;
    НайденнаяСсылка = Валюты.НайтиПоКоду(СтрокаКода);

    Если НайденнаяСсылка = Валюты.ПустаяСсылка() Тогда
        Сообщить("Валюты """ + СтрокаКода + """ еще нет");
    КонецЕсли;
КонецПроцедуры;

//== Find.bsl
