#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПослеОбработки
Процедура ПослеОбработкиПравилаРегистрации(Объект, Отказ, Параметры) Экспорт
	
	Если Параметры.Выгрузка Или Параметры.Получатели.Количество() = 0 Или Отказ
		Или ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Объект.ДополнительныеСвойства, "Выгрузка", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Получатели.Количество() > 0 Тогда
		ОбъектыДляРегистрации = Объект.СовместноРегистрируемыеОбъекты();
		Для Каждого ОбъектДляРегистрации Из ОбъектыДляРегистрации Цикл
			Если ЗначениеЗаполнено(ОбъектДляРегистрации) И ОбщегоНазначения.СсылкаСуществует(ОбъектДляРегистрации) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(Параметры.Получатели, ОбъектДляРегистрации);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
