&НаКлиенте
Процедура ОтправитьПочту(Команда)
    Перем HTML, Картинки;

    Профиль = ПолучитьПрофиль();

    Сообщение = Новый ИнтернетПочтовоеСообщение;
    Сообщение.Тема = "Форматированный документ";
    Сообщение.Отправитель = АдресОтправителя;

    // Хардкод электронной почты
    Справочники.Контрагенты.Поставщик.Почта = "ferw45@mail.com";

    Сообщение.Получатели.Добавить(АдресПолучателя);
    // Хардкод электронной почты
    Сообщение.Получатели.Добавить("director@mail.com");

    ТекстСообщения = Сообщение.Тексты.Добавить(HTML, ТипТекстаПочтовогоСообщения.HTML);
    Почта = Новый ИнтернетПочта;

    // Хардкод электронной почты
    Сообщ = Новый СообщениеПользователю(
        "Благодарим за сотрудничество !
        | Наши контакты:
        | - companyHR@mail.com"
    );

    Попытка
        Почта.Подключиться(Профиль);
        Почта.Послать(Сообщение);
    Исключение
        Возврат;
    КонецПопытки;

    Почта.Отключиться();
КонецПроцедуры