//-- CurrentDate.bsl

Функция ДатаПроведенияДокумента()
    // Функция ТекущаяДата
	ДатаПроведенияДокумента = ТекущаяДата();
	Возврат ДатаПроведенияДокумента;
КонецФункции


Функция ВремяПокупки()
    // Функция ТекущаяДата
	ВремяПокупки = Формат(ТекущаяДата(), "ДЛФ=T");
	Возврат ВремяПокупки;
КонецФункции


Функция ВремяНачалаСмены()
	ВремяНачалаСмены = Формат(ТекущаяДатаСеанса(), "ДЛФ=T");
	Возврат ВремяНачалаСмены;
КонецФункции


Функция ДатаПроведенияДляДругогоЧасовогоПояса()
    // Функция ТекущаяДата
	ДатаПроведенияДляДругогоЧасовогоПояса = УниверсальноеВремя(ТекущаяДата());
	Возврат ДатаПроведенияДляДругогоЧасовогоПояса;
КонецФункции

//== CurrentDate.bsl