//-- EmptyOperator.bsl

Процедура Пример()
    Если 1 = 1 Тогда
        Сообщить("Условие выполнено");;		                                //Пустой оператор
    Иначе
        Сообщить("Условие не выполнено");;		                            //Пустой оператор
    КонецЕсли;;					                                            //Пустой оператор

    Для Счетчик = 1 По 3 Цикл
        Сообщить("Итерация: " + Строка(Счетчик));;	                        //Пустой оператор
    КонецЦикла;;					                                        //Пустой оператор

    Счетчик = 1;
    Пока Счетчик <= 3 Цикл
        Сообщить("Итерация: " + Строка(Счетчик));;	                        //Пустой оператор
        Счетчик = Счетчик + 1;;			                                    //Пустой оператор
    КонецЦикла;;;;;;;;				                                        //Пустой оператор x7

    Для Счетчик = 1 По 5 Цикл
        Если Счетчик = 3 Тогда
            Продолжить;;				                                    //Пустой оператор
        КонецЕсли;;					                                        //Пустой оператор
        Сообщить("Итерация: " + Строка(Счетчик));;	                        //Пустой оператор
    КонецЦикла;;					                                        //Пустой оператор

    Для Счетчик = 1 По 5 Цикл
        Если Счетчик = 3 Тогда
            Прервать;;				                                        //Пустой оператор
        КонецЕсли;;					                                        //Пустой оператор
            Сообщить("Итерация: " + Строка(Счетчик));;;;                    //Пустой оператор x3
    КонецЦикла;;;					                                        //Пустой оператор x2
    Сообщить("Начало процедуры");;;		                                    //Пустой оператор x2
    Выйти;;;;					                                            //Пустой оператор x3
    Сообщить("Это сообщение не будет показано");;;;                         //Пустой оператор x3
КонецПроцедуры

Функция ПримерВозврат()
    Возврат 42;;;				                                            //Пустой оператор x2
КонецФункции

Процедура Пример2()
    Попытка
        Сообщить("Попытка");;			                                    //Пустой оператор
        ВызватьИсключение "Исключение";;		                            //Пустой оператор
    Исключение
        Сообщить("Исключение");;			                                //Пустой оператор
    КонецПопытки;;				                                            //Пустой оператор
КонецПроцедуры

//== EmptyOperator.bsl
