//-- EmptyOperator-onlySemicolon.bsl

Процедура Пример1()
    Для Каждого СтрокаТовары Из Товары Цикл
        ;                                                           //Пустой оператор
    КонецЦикла;
КонецПроцедуры


Процедура Пример2()
    Для Каждого СтрокаТовары Из Товары Цикл
        ;                                                           //Пустой оператор
        Движение = Движения.СвободныеОстатки.Добавить();
    КонецЦикла;
КонецПроцедуры

Функция ПримерВозврат()
    ;						                                        //Пустой оператор
    Возврат 42;
КонецФункции

Процедура Пример3()
    ;						                                        //Пустой оператор
    Если 1 = 1 Тогда
	    ;					                                        //Пустой оператор
        Сообщить("Условие выполнено");
    Иначе
	    ;;					                                        //Пустой оператор x2
        Сообщить("Условие не выполнено");
    КонецЕсли;
КонецПроцедуры


Функция ПримерВозврат()
    ;						                                        //Пустой оператор
КонецФункции

//== EmptyOperator-onlySemicolon.bsl
