//-- UnclosedOperator.bsl

Процедура Пример()
  Если 1 = 1 Тогда
    Сообщить("Условие выполнено")					        	//Выражение должно заканчиваться символом ";"
  Иначе
    Сообщить("Условие не выполнено")					    	//Выражение должно заканчиваться символом ";"
КонецЕсли;

  Для Счетчик = 1 По 3 Цикл
    Сообщить("Итерация: " + Строка(Счетчик))					//Выражение должно заканчиваться символом ";"
  КонецЦикла;

  Счетчик = 1;
  Пока Счетчик <= 3 Цикл
    Сообщить("Итерация: " + Строка(Счетчик));
    Счетчик = Счетчик + 1							            //Выражение должно заканчиваться символом ";"
  КонецЦикла;

  Для Счетчик = 1 По 5 Цикл
    Если Счетчик = 3 Тогда
        Продолжить								                //Выражение должно заканчиваться символом ";"
    КонецЕсли;
    Сообщить("Итерация: " + Строка(Счетчик))					//Выражение должно заканчиваться символом ";"
  КонецЦикла;

  Для Счетчик = 1 По 5 Цикл
    Если Счетчик = 3 Тогда
        Прервать								                //Выражение должно заканчиваться символом ";"
    КонецЕсли;
    Сообщить("Итерация: " + Строка(Счетчик))					//Выражение должно заканчиваться символом ";"
  КонецЦикла;
КонецПроцедуры

Процедура Пример2()
    Сообщить("АА")                                              //Выражение должно заканчиваться символом ";"
КонецПроцедуры

//== UnclosedOperator.bsl