//-- EmptyOperator-correctExample.bsl

Процедура Пример()
    Если 1 = 1 Тогда
        Сообщить("Условие выполнено");
    Иначе
        Сообщить("Условие не выполнено");
    КонецЕсли;

    Для Счетчик = 1 По 3 Цикл
        Сообщить("Итерация: " + Строка(Счетчик));
    КонецЦикла;

    Счетчик = 1;
    Пока Счетчик <= 3 Цикл
        Сообщить("Итерация: " + Строка(Счетчик));
        Счетчик = Счетчик + 1;
    КонецЦикла;

    Для Счетчик = 1 По 5 Цикл
        Если Счетчик = 3 Тогда
            Продолжить;
        КонецЕсли;
        Сообщить("Итерация: " + Строка(Счетчик));
    КонецЦикла;

    Для Счетчик = 1 По 5 Цикл
        Если Счетчик = 3 Тогда
            Прервать;
        КонецЕсли;
            Сообщить("Итерация: " + Строка(Счетчик));
    КонецЦикла;
    Сообщить("Начало процедуры");
    Выйти;
    Сообщить("Это сообщение не будет показано");
КонецПроцедуры

Функция ПримерВозврат()
    Возврат 42;
КонецФункции

Процедура Пример2()
    Попытка
        Сообщить("Попытка");
        ВызватьИсключение "Исключение";
    Исключение
        Сообщить("Исключение");
    КонецПопытки;
КонецПроцедуры

//== EmptyOperator-correctExample.bsl
