////////////////////////////////////////////////////////////////////////////////
// Подсистема "Синхронизация данных".
// Серверные процедуры, обслуживающие правила регистрации объектов.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// Заполняет настройки обработчиков правил регистрации для объекта метаданных.
// 
// Параметры:
//  Настройки - см. СинхронизацияДанныхЗарплатаКадрыСервер.НоваяТаблицаНастроекОбработчиковПравилРегистрации
//  ОбъектМетаданных - ОбъектМетаданных
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных) Экспорт

	// СтандартныеПодсистемы.БизнесПроцессыИЗадачи
	Если ОбъектМетаданных = Метаданные.Задачи.ЗадачаИсполнителя
		Или ОбъектМетаданных = Метаданные.Справочники.ГруппыИсполнителейЗадач Тогда
		СвойстваОбъекта = ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве("ОсновнойОбъектАдресации",
			"ДополнительныйОбъектАдресации");
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, СвойстваОбъекта, Неопределено);
	ИначеЕсли ОбъектМетаданных = Метаданные.ПланыВидовХарактеристик.ОбъектыАдресацииЗадач Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, "Ссылка", Неопределено);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ДанныеБизнесПроцессов Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ДанныеБизнесПроцессов.Измерения.Владелец);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсполнителиЗадач Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ИсполнителиЗадач.Измерения.ОсновнойОбъектАдресации);
			
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ВерсииОбъектов Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ВерсииОбъектов.Измерения.Объект);
			
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ДатыЗапретаИзменения Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ДатыЗапретаИзменения.Измерения.Объект);
				
	// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ОтзывСогласияНаОбработкуПерсональныхДанных
		Или ОбъектМетаданных = Метаданные.Документы.СогласиеНаОбработкуПерсональныхДанных Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, ,Неопределено);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СогласияНаОбработкуПерсональныхДанных Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СубъектыДляСкрытияПерсональныхДанных Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.СубъектыДляСкрытияПерсональныхДанных.Измерения.Субъект);
	
	// СтандартныеПодсистемы.Печать
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.МакетыПечатныхФорм Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОграниченияПоРеквизиту(Настройки,
			Метаданные.Справочники.МакетыПечатныхФорм.Реквизиты.ИсточникДанных,
			"ОбщиеДанные");
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Файлы Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ПапкиФайлов Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.НаличиеФайлов Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.НаличиеФайлов.Измерения.ОбъектСФайлами);
	
	// СтандартныеПодсистемы.Свойства
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ДополнительныеСведения Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ДополнительныеСведения.Измерения.Объект);
			
	// СтандартныеПодсистемы.УправлениеДоступом
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ГруппыЗначенийДоступа Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ГруппыЗначенийДоступа.Измерения.ГруппаЗначенийДоступа);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ЗначенияГруппДоступа Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ЗначенияГруппДоступа.Измерения.ЗначениеДоступа);
	
	// СтандартныеПодсистемы.ЭлектроннаяПодпись
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ЗаявленияНаВыпускСертификата Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ЗаявленияНаВыпускСертификата.Измерения.Сертификат,
			"ОбщиеДанные");
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ОповещенияПользователейСертификатов Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ОповещенияПользователейСертификатов.Измерения.Сертификат,
			"ОбщиеДанные");
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

