//-- EmptyCatchBlock.bsl
&НаКлиенте
Процедура TryProc1()
    Попытка
        ВыполнитьОперацию();
    Исключение
        // Пустой блок «Исключение»
    КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура TryProc2()
    Попытка
        ВыполнитьОперацию();
        Message("Done !");
    Исключение
        // Пустой блок «Исключение»
    КонецПопытки;

    Попытка
        ВыполнитьОперацию();
        Message("Done !");
    Исключение
        Message("Failed!");
    КонецПопытки;
КонецПроцедуры
//== EmptyCatchBlock.bsl
