&НаКлиенте
Процедура ЗапуститьОбработку(Команда)
    // Запуск внешней обработки
    ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьКФайлу);
    ВнешняяОбработка.ПолучитьФорму().Открыть();

    // Запуск внешнего отчета
    ВнешнийОтчет = ВнешниеОтчеты.Создать(ПолноеИмяФайла);
    ВнешнийОтчет.ПолучитьФорму().Открыть();

    // Небезопасный режим запуска внешней обработки
    ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьКФайлу, Ложь);
    ВнешняяОбработка.ПолучитьФорму().Открыть();

    // Небезопасный режим запуска внешнего отчета
    ВнешнийОтчет = ВнешниеОтчеты.Создать(ПолноеИмяФайла, Ложь);
    ВнешнийОтчет.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаСервере
Функция ПодключитьВнешнююОбработку(АдресХранилища)
    // Подключение внешней обработки
	Возврат ВнешниеОбработки.Подключить(АдресХранилища);
КонецФункции

&НаСервере
Функция ПодключитьВнешнийОтчет(АдресХранилища)
    // Подключение внешнего отчета
	Возврат ВнешниеОтчеты.Подключить(АдресХранилища);
КонецФункции

&НаСервере
Функция НебезопасноПодключитьВнешнююОбработку(АдресХранилища)
    // Небезопасный режим подключения внешней обработки
	Возврат ВнешниеОбработки.Подключить(АдресХранилища,,Ложь);
КонецФункции

&НаСервере
Функция НебезопасноПодключитьВнешнийОтчет(АдресХранилища, Имя)
    // Небезопасный режим подключения внешнего отчета
	Возврат ВнешниеОтчеты.Подключить(АдресХранилища, Имя, Ложь);
КонецФункции
