//-- HardcodedPassword.bsl
Процедура HardcodedPassword()
    Перем пароль;

    // Явно заданное значение пароля
    парОль = "Secret";
    парОль = пароль;
    // Явно заданное значение пароля
    прл = "12345";
    // Явно заданное значение пароля
    password = "12345";
    // Явно заданное значение пароля
    passWD = "12345";
    // Явно заданное значение пароля
    paswd = 12345;
    // Явно заданное значение пароля
    psWord = 12345.34;
    // Явно заданное значение пароля
    pswd = "12345";
    // Явно заданное значение пароля
    PWD = "12345";
    // Явно заданное значение пароля
    pword = "12345";
    // Явно заданное значение пароля
    Профиль.ПарольSMTP = "222222";
    Профиль.ПарольSMTP = пароль;

    Профиль = новый ИнтернетПочтовыйПрофиль;
    Профиль.АдресСервераSMTP = "smtp.yandex.ru";
    Профиль.ПользовательSMTP = "111";

    Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
КонецПроцедуры
//== HardcodedPassword.bsl
