//-- OSExecution.bsl
Процедура Метод()
    СтрокаКоманды = "";
    ТекущийКаталог = "";
    ДождатьсяЗавершения = Истина;
    ОписаниеОповещения = Неопределено;
    ПараметрыКоманды = Новый Структура;

    КомандаСистемы(СтрокаКоманды, ТекущийКаталог); // Выполнение команд ОС

    ПерейтиПоНавигационнойСсылке(СтрокаКоманды); // есть замечание BSL
    ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрокаКоманды); // есть замечание BSL
    ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрокаКоманды, ОписаниеОповещения); // есть замечание BSL

КонецПроцедуры

&НаКлиенте
Асинх Процедура Подключить()
    СтрокаКоманды = "";
    ТекущийКаталог = "";
    ДождатьсяЗавершения = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗапуститьСистему(ДополнительныеПараметрыКоманднойСтроки, КодВозврата)
    ДождатьсяЗавершения = Истина;

    ЗапуститьСистему(); // Выполнение команд ОС
    ЗапуститьСистему(ДополнительныеПараметрыКоманднойСтроки); // Выполнение команд ОС
    ЗапуститьСистему(ДополнительныеПараметрыКоманднойСтроки, ДождатьсяЗавершения); // Выполнение команд ОС
    ЗапуститьСистему(ДополнительныеПараметрыКоманднойСтроки, ДождатьсяЗавершения, КодВозврата); // Выполнение команд ОС
КонецПроцедуры
//== OSExecution.bsl
