//-- PrivilegedMod.bsl
&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьСпособДоставки(Рассылка, Знач ПараметрыДоставки) Экспорт
    // Привилегированный режим
    УстановитьПривилегированныйРежим(Истина);
        Попытка
            ShellApplication.SetTime();
        Исключение
            ПараметрыЖурнала.Вставить("Данные",  Рассылка);
        КонецПопытки;
        возврат ПараметрыЖурнала;
    УстановитьПривилегированныйРежим(Ложь);


    Для НазваниеПерем = СчетчНачало по СчетчКонец Цикл
        Если 1 < 0 Тогда
            // Привилегированный режим
            УстановитьПривилегированныйРежим(Истина);
            УстановитьПривилегированныйРежим(Ложь);
        Иначе
            Для н = 1 по 100 Цикл
                // Привилегированный режим
                УстановитьПривилегированныйРежим(Истина);
                Сообщить("Команда выполняется в привилегированном режиме !");
                УстановитьПривилегированныйРежим(Ложь);
            КонецЦикла;
                // Привилегированный режим
                // Некорректная деактивация привилегированного режима
                УстановитьПривилегированныйРежим(Истина);
                Сообщить("Команда выполняется в привилегированном режиме !");
        КонецЕсли;

        // Привилегированный режим
        // Некорректная деактивация привилегированного режима
        УстановитьПривилегированныйРежим(Истина);
        Сообщить("Команда выполняется в привилегированном режиме !");
    КонецЦикла;
КонецФункции
//== PrivilegedMod.bsl
