&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если ТипЗнч(ВходящийПараметр) = Тип("Структура") Тогда
        Результат = ЗаполнитьПоСтруктуре(ВходящийПараметр);
    Иначе
        Результат = ЗаполнитьПоДокументу(ВходящийПараметр);
    КонецЕсли;

    Если ТипЗнч(ВходящийПараметр) = Тип("Структура") Тогда
        Результат = ЗаполнитьПоСтруктуре(ВходящийПараметр);
    КонецЕсли;

    Если ТипЗнч(ВходящийПараметр) = Тип("Структура") Тогда
        Результат = ЗаполнитьПоСтруктуре(ВходящийПараметр);
    ИначеЕсли ТипЗнч(ВходящийПараметр) = Тип("Документ.Ссылка.ВажныйДокумент") Тогда
        Результат = ЗаполнитьПоДокументу(ВходящийПараметр);
    КонецЕсли; // !

    Если ТипЗнч(ВходящийПараметр) = Тип("Структура") Тогда
        Результат = ЗаполнитьПоСтруктуре(ВходящийПараметр);
    ИначеЕсли ТипЗнч(ВходящийПараметр) = Тип("Документ.Ссылка.ВажныйДокумент") Тогда
        Результат = ЗаполнитьПоДокументу(ВходящийПараметр);
    Иначе
        ВызватьИсключение "Передан параметр неверного типа";
    КонецЕсли;

КонецПроцедуры