//-- ExecuteStatement.bsl
&НаКлиенте
Функция ВыполнитьОператором() Экспорт
    // Оператор «Выполнить»
    Выполнить("Сообщить(""Сообщение выведено оператором Выполнить"");");

    ИсходныйКод = "Рез = 2+3; Сообщить(Рез);";
    // Оператор «Выполнить»
    Execute(ИсходныйКод);

    Выражение = "2 + 3 * 5";
    // Оператор Вычислить
    Вычислить("Сообщить(""Сообщение выведено оператором Выполнить"");");
    // Оператор Вычислить
    Evaluate(ИсходныйКод);

    // Оператор «Выполнить»
    Выполнить Алгоритм;

КонецФункции
//== ExecuteStatement.bsl
